gift_list = {
    "洗护": 0,
    "美妆": 1,
    "男装": 2,
    "女装": 3,
    "运动": 4,
    "数码": 5,
    "手机": 6,
    "电器": 7,
    "食品": 8,
    "箱包": 9,
    "鞋靴": 10,
    "饰品": 11,
    "车品": 12,
    "保健": 13,
    "鲜花": 14,
    "盆栽": 15,
}  # 16

label_list = {
    "阅读": 0,
    "运动": 1,
    "美食": 2,
    "旅游": 3,
    "音乐": 4,
    "影视": 5,
    "书画": 6,
    "服饰": 7,
    "宠物": 8,
    "美妆": 9,
    "游戏": 10,
    "园艺": 11,
}  # 12

color_list = {
    "红色": 0,
    "黄色": 1,
    "绿色": 2,
    "蓝色": 3,
    "黑色": 4,
    "白色": 5,
    "灰色": 6,
    "粉色": 7,
}  # 8
